zephyrproject-rtos/hal_gigadevice/scripts/tests/gd32pinctrl/data/gd32f999y(0-1)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32f999xx-afio.h"

/* PERIPH1_SIGA */
#define PERIPH1_SIGA_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, PERIPH1_NORMP)
#define PERIPH1_SIGA_PA1_RMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, PERIPH1_RMP)

/* PERIPH1_SIGB */
#define PERIPH1_SIGB_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, PERIPH1_NORMP)
#define PERIPH1_SIGB_PA0_RMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, PERIPH1_RMP)

/* PERIPH2_SIGA */
#define PERIPH2_SIGA_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, PERIPH2_NORMP)
#define PERIPH2_SIGA_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, PERIPH2_NORMP)
#define PERIPH2_SIGA_PA3_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, PERIPH2_PRMP)
#define PERIPH2_SIGA_PA3_INP_PRMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, PERIPH2_PRMP)
#define PERIPH2_SIGA_PA4_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, PERIPH2_FRMP)
#define PERIPH2_SIGA_PA4_INP_FRMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, PERIPH2_FRMP)

/* PERIPH2_SIGB */
#define PERIPH2_SIGB_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, PERIPH2_NORMP)
#define PERIPH2_SIGB_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, PERIPH2_NORMP)
#define PERIPH2_SIGB_PA4_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, PERIPH2_PRMP)
#define PERIPH2_SIGB_PA4_INP_PRMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, PERIPH2_PRMP)
#define PERIPH2_SIGB_PA5_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, PERIPH2_FRMP)
#define PERIPH2_SIGB_PA5_INP_FRMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, PERIPH2_FRMP)

/* PERIPH2_SIGC */
#define PERIPH2_SIGC_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, PERIPH2_NORMP)
#define PERIPH2_SIGC_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, PERIPH2_NORMP)
#define PERIPH2_SIGC_PA5_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, PERIPH2_PRMP)
#define PERIPH2_SIGC_PA5_INP_PRMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, PERIPH2_PRMP)
#define PERIPH2_SIGC_PA2_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, PERIPH2_FRMP)
#define PERIPH2_SIGC_PA2_INP_FRMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, PERIPH2_FRMP)

/* PERIPH2_SIGD */
#define PERIPH2_SIGD_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, PERIPH2_NORMP)
#define PERIPH2_SIGD_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, PERIPH2_NORMP)
#define PERIPH2_SIGD_PA2_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, PERIPH2_PRMP)
#define PERIPH2_SIGD_PA2_INP_PRMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, PERIPH2_PRMP)
#define PERIPH2_SIGD_PA3_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, PERIPH2_FRMP)
#define PERIPH2_SIGD_PA3_INP_FRMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, PERIPH2_FRMP)
